Combina df1 e df2 impilandoli uno sopra l'altro.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({
'A': ['foo', 'bar'],
'B': [1, 2]
})

df2 = pd.DataFrame({
'A': ['baz', 'qux'],
'B': [3, 4]
})
df1

     A  B
0  foo  1
1  bar  2

In [3]:
df2

     A  B
0  baz  3
1  qux  4

In [4]:
df_res = pd.concat([df1, df2])
df_res

     A  B
0  foo  1
1  bar  2
0  baz  3
1  qux  4

Unisci df1 e df2 sulle colonne 'chiave1' e 'chiave2' includendo tutte le righe di df1. Qual Ã¨ il DataFrame risultante?

In [5]:
df1 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K2'],
'chiave2': ['K0', 'K1', 'K0'],
'A': ['A0', 'A1', 'A2']
})

df2 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K3'],
'chiave2': ['K0', 'K0', 'K0'],
'B': ['B0', 'B1', 'B3']
})

In [6]:
# df_res = df1.combine_first(df2)
# df_res = pd.concat([df1, df2], axis="columns", keys='chiave1')
df_res = pd.merge(df1, df2, left_on=['chiave1', 'chiave2'], right_on=['chiave1', 'chiave2'], how='left')
df_res

  chiave1 chiave2   A    B
0      K0      K0  A0   B0
1      K1      K1  A1  NaN
2      K2      K0  A2  NaN

Combina df1 e df2 affiancandoli, allineando gli indici.

In [7]:
df1 = pd.DataFrame({
'A': ['A0', 'A1', 'A2'],
'B': ['B0', 'B1', 'B2']
}, index=[0, 1, 2])

df2 = pd.DataFrame({
'C': ['C0', 'C1', 'C2'],
'D': ['D0', 'D1', 'D2']
}, index=[0, 2, 3])

In [8]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [9]:
df2

    C   D
0  C0  D0
2  C1  D1
3  C2  D2

In [10]:
# df_res = pd.concat([df1, df2], axis="columns")
df_res = df1.combine_first(df2)
df_res

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1  NaN  NaN
2   A2   B2   C1   D1
3  NaN  NaN   C2   D2

Unisci prima df1 e df2 includendo solo le chiavi comuni.
Poi, unisci il risultato con df3 includendo tutte le chiavi di df3.

In [11]:
df1 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2', 'K3'],
'A': ['A0', 'A1', 'A2', 'A3']
})

df2 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2'],
'B': ['B0', 'B1', 'B2']
})

df3 = pd.DataFrame({
'chiave': ['K1', 'K2', 'K4'],
'C': ['C1', 'C2', 'C4']
})

In [12]:
df_1_2 = pd.merge(df1, df2, how='inner', on='chiave')
df_1_2

  chiave   A   B
0     K0  A0  B0
1     K1  A1  B1
2     K2  A2  B2

In [13]:
df_re = df3.combine_first(df_1_2)
df_re

    A   B   C chiave
0  A0  B0  C1     K1
1  A1  B1  C2     K2
2  A2  B2  C4     K4

Riorganizza il DataFrame in modo che ogni categoria diventi una colonna e i valori siano distribuiti di conseguenza per ogni data.

In [14]:
data = {
'Data': ['2024-01', '2024-01', '2024-02', '2024-02'],
'Categoria': ['A', 'B', 'A', 'B'],
'Valore': [10, 20, 15, 25]
}

df = pd.DataFrame(data)
df

      Data Categoria  Valore
0  2024-01         A      10
1  2024-01         B      20
2  2024-02         A      15
3  2024-02         B      25

In [15]:
df_pivot = df.pivot(index='Data', columns='Categoria', values='Valore')
df_pivot

Categoria   A   B
Data
2024-01    10  20
2024-02    15  25

Crea una tabella pivot che mostri la somma delle vendite per ogni venditore e mese. (Funzione all'interno del pivot)

In [16]:
data = {
'Venditore': ['Alice','Alice', 'Bob', 'Alice', 'Bob', 'Charlie'],
'Mese': ['Gennaio','Gennaio', 'Gennaio', 'Febbraio', 'Febbraio', 'Gennaio'],
'Vendite': [200, 200, 150, 300, 250, 100]
}

df = pd.DataFrame(data)
df

  Venditore      Mese  Vendite
0     Alice   Gennaio      200
1     Alice   Gennaio      200
2       Bob   Gennaio      150
3     Alice  Febbraio      300
4       Bob  Febbraio      250
5   Charlie   Gennaio      100

In [17]:
df_pivot = df.pivot_table(index='Venditore', columns='Mese', values='Vendite', margins=True, aggfunc="sum", margins_name='Totale')
df_pivot

Mese       Febbraio  Gennaio  Totale
Venditore
Alice         300.0    400.0     700
Bob           250.0    150.0     400
Charlie         NaN    100.0     100
Totale        550.0    650.0    1200

In [18]:
df_pivot = df.pivot_table(index='Venditore', columns='Mese', values='Vendite', margins=True, aggfunc="sum", margins_name='Totale', fill_value=0.)
df_pivot = df_pivot.iloc[:-1]
df_pivot

Mese       Febbraio  Gennaio  Totale
Venditore
Alice         300.0    400.0     700
Bob           250.0    150.0     400
Charlie         0.0    100.0     100